app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
  def index
   @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8)

INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "picture [in maybe"], ["user_id", 1], ["created_at", "2016-10-25 07:58:05.904971"], ["updated_at", "2016-10-25 07:58:05.904971"]]
---
  def create
      @pin = current_user.pins.build(pin_params)
    if @pin.save